* Notes on ABCL code style

+ no tab characters

+ two space character indent default

+ Formatted like Emacs/Slime does with defaults

  #+begin_src elisp
    ;;; Editing modes for Algo-derived languages
    (setq-default indent-tabs-mode nil)
    (setq c-basic-indent 2)
    (add-hook 'java-mode-hook 
              (lambda () 
                (setq c-basic-indent 2)))
  #+end_src


** Lint implementation prototype
#+begin_src elisp 
  (defun all-files (directory)
    (let ((files
           (directory-files (expand-file-name directory) t)))
      (cl-remove-if
       (lambda (path)
         (or
          (string-match "\\/.$" path)
          (string-match "\\/..$" path)
          ;; don't change the upstream representation of ASDF
          (string-match "asdf.lisp$" path) 
          (string-match "#$" path)
          (string-match "/\\.#.+$" path)
          (string-match "\\./$" path)))
       files)))

  (all-files "~/work/abcl/src/org/armedbear/lisp")
#+end_src

#+RESULTS:
| /Users/evenson/work/abcl/src/org/armedbear/lisp/AbstractArray.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/AbstractBitVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/AbstractString.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/AbstractVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ArgumentListProcessor.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ArithmeticError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Autoload.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/AutoloadGeneralizedReference.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/AutoloadMacro.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BasicVector_ByteBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BasicVector_CharBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BasicVector_IntBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BasicVector_UnsignedByte16.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BasicVector_UnsignedByte32.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BasicVector_UnsignedByte8.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Bignum.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Binding.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BroadcastStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/BuiltInClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ByteArrayInputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ByteArrayOutputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CapitalizeFirstStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CapitalizeStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CaseFrobStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CellError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CharHashMap.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CharacterFunctions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Closure.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ClosureBinding.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CompiledClosure.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/CompiledPrimitive.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Complex.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexArray.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexArray_ByteBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexArray_IntBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexArray_UnsignedByte32.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexArray_UnsignedByte8.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexBitVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexString.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexVector_ByteBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexVector_IntBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexVector_UnsignedByte32.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ComplexVector_UnsignedByte8.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ConcatenatedStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Condition.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Cons.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ControlError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ControlTransfer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Debug.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/DispatchMacroFunction.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/DivisionByZero.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Do.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/DocString.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/DoubleFloat.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/DowncaseStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/EMFCache.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/EchoStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/EndOfFile.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Environment.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Extensions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FaslClassLoader.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FaslReader.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FaslReadtable.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FileError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FileStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FillPointerOutputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Fixnum.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FloatFunctions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FloatingPointInexact.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FloatingPointInvalidOperation.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FloatingPointOverflow.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FloatingPointUnderflow.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FuncallableStandardClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FuncallableStandardObject.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Function.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/FunctionBinding.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Go.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/HashTable.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/HashTableFunctions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/IllegalMonitorState.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/IntegrityError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Interpreter.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JHandler.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JProxy.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JarPathname.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JarStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Java.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JavaBeans.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JavaClassLoader.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JavaException.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JavaObject.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/JavaStackFrame.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Keyword.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LICENSE | /Users/evenson/work/abcl/src/org/armedbear/lisp/Layout.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Lisp.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispCharacter.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispInteger.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispObject.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispReader.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispStackFrame.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LispThread.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Load.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/LogicalPathname.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/MacroObject.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Main.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/MathFunctions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/MemoryClassLoader.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Nil.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/NilVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Operator.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Package.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/PackageError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/PackageFunctions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Packages.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ParseError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Pathname.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Primitive.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Primitives.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/PrintNotReadable.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ProcessingTerminated.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Profiler.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ProgramError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/RandomState.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Ratio.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ReaderError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ReaderMacroFunction.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Readtable.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Return.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/RuntimeClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SeekableStringWriter.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SeriousCondition.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ShellCommand.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_ByteBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_CharBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_IntBuffer.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_T.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_UnsignedByte16.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_UnsignedByte32.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleArray_UnsignedByte8.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleBitVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleCondition.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleString.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleTypeError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleVector.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SimpleWarning.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SingleFloat.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Site.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SiteName.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SlimeInputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SlimeOutputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SlotClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SlotDefinition.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SlotDefinitionClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SocketStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SpecialBinding.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SpecialBindingsMark.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SpecialOperator.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SpecialOperators.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StackFrame.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StandardClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StandardObject.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StorageCondition.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Stream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StreamError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StringFunctions.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StringInputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StringOutputStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StructureClass.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StructureObject.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/StyleWarning.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Symbol.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SymbolMacro.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/SynonymStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ThreadDestroyed.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Throw.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Time.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/TwoWayStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/TypeError.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/URLPathname.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/URLStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/UnboundSlot.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/UnboundVariable.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/UndefinedFunction.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/UpcaseStream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Utilities.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Version.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/Warning.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/WeakHashTable.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/WeakReference.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/WrongNumberOfArgumentsException.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ZeroRankArray.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/ZipCache.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/abcl-contrib.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/adjoin.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/adjust_array.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/and.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/apropos.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/arglist.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/arrays.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/asdf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ash.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/assert.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/assoc.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/assq.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/assql.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/autoloads-gen.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/autoloads.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/aver.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/backquote.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/bit-array-ops.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/boole.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/boot.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/butlast.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/byte-io.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/case.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ceiling.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/cell_error_name.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/chars.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/check-type.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/clos.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/coerce.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/collect.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compile-file-pathname.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compile-file.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compile-system.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compiler-error.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compiler-macro.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compiler-pass1.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compiler-pass2.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/compiler-types.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/concatenate.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/cond.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/copy-seq.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/copy-symbol.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/copy_list.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/count.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/create_new_file.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/cxr.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/debug.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/define-modify-macro.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/define-symbol-macro.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/defmacro.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/defpackage.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/defsetf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/defstruct.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/deftype.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/delete-duplicates.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/delete.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/delete_file.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/deposit-field.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/describe-compiler-policy.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/describe.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/destructuring-bind.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/digest.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/directory.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/disassemble.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/disassemble_class_bytes.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/do-all-symbols.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/do-external-symbols.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/do-symbols.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/do.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/documentation.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/dolist.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/dolist.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/dotimes.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/dotimes.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/dribble.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/dump-class.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/dump-form.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/early-defuns.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ed.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/enough-namestring.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ensure-directories-exist.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/error.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/extensible-sequences-base.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/extensible-sequences.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/fasl-concat.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/fdefinition.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/featurep.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/file_author.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/file_length.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/file_string_length.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/file_write_date.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/fill.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/find-all-symbols.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/find.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/float_sign.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/floor.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/format.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ftruncate.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/function_info.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/gc.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/gentemp.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/get-pid.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/get_properties.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/gray-streams.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/gui.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/inline.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/input_stream_p.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/inspect.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/interactive_stream_p.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/java | /Users/evenson/work/abcl/src/org/armedbear/lisp/java-collections.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/java.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/jclass_name.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/jclass_of.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/jmethod_return_type.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/jvm-class-file.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/jvm-instructions.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/jvm.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/known-functions.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/known-symbols.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/last.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/late-setf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/lcm.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ldb.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/ldiff.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/lisp_implementation_type.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/lisp_implementation_version.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/list-length.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/list.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/listen.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/load.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/logand.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logandc1.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logandc2.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logbitp.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logcount.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logeqv.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logior.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/lognand.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/lognor.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/lognot.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logorc1.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logorc2.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logtest.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/logxor.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/loop.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/machine_type.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/machine_version.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/macros.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/make-hash-table.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/make-load-form-saving-slots.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/make-sequence.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/make-string-output-stream.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/make-string.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/make_array.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/make_condition.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/make_server_socket.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/make_socket.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/map-into.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/map.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/map1.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/mask-field.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/member-if.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/mismatch.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/mod.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/mop.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/multiple-value-bind.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/multiple-value-list.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/multiple-value-setq.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/nsubstitute.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/nth-value.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/numbers.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/open.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/open_stream_p.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/or.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/output_stream_p.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/package.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/parse-integer.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/parse-lambda-list.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/pathnames.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/peek_char.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/pprint-dispatch.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/pprint.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/precompiler.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/print-object.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/print-unreadable-object.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/print.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/probe_file.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/proclaim.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/profiler.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/prog.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/protocol | /Users/evenson/work/abcl/src/org/armedbear/lisp/psetf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/query.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/read-circle.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/read-conditional.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/read-from-string.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/read-sequence.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/reduce.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/rem.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/remf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/remove-duplicates.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/remove.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/replace.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/require.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/restart.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/revappend.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/room.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/rotatef.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/run-benchmarks.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/run-program.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/run-shell-command.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/runtime-class.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/scripting | /Users/evenson/work/abcl/src/org/armedbear/lisp/search.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/sequences.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/server_socket_close.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/setf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/sets.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/shiftf.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/signal.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/simple_list_remove_duplicates.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/socket.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/socket_accept.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/socket_close.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/socket_stream.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/software_type.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/software_version.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/sort.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/source-transform.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/step.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/stream_element_type.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/strings.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/sublis.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/subst.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/substitute.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/subtypep.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/tailp.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/threads.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/time.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/top-level.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/trace.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/tree-equal.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/truncate.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/typep.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/unbound_slot_instance.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/unzip.java | /Users/evenson/work/abcl/src/org/armedbear/lisp/upgraded-complex-part-type.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/util | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-accessors.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-hash-table-iterator.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-input-from-string.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-open-file.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-output-to-string.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-package-iterator.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-slots.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/with-standard-io-syntax.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/write-sequence.lisp | /Users/evenson/work/abcl/src/org/armedbear/lisp/zip.java |

#+begin_src elisp
  (defun abcl-style-transform (file)
    (save-excursion
      (message "Untabifying %s" file)
      (find-file file)
      (mark-whole-buffer)
      (untabify
       (region-beginning) (region-end))
      (save-buffer)))

  (abcl-style-transform "/Users/evenson/work/abcl/src/org/armedbear/lisp/AbstractArray.java")
#+end_src

#+begin_src elisp
  (defun style-source-units (directory)
   "Untabify source files under directory"
   ;; get a list of a files under a directory
   (dolist (file
            (all-files directory))
     (abcl-style-transform file)))

  (style-source-units "~/work/abcl/src/org/armedbear/lisp")
#+end_src

#+RESULTS:
